Revit 2026 API

# CameraProjectionMethod Property

---

Projection method

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ProjectionMethod ProjectionMethod { get; set; }
```
```vb
Public Property ProjectionMethod As ProjectionMethod
	Get
	Set
```
```cpp
public:
property ProjectionMethod ProjectionMethod {
	ProjectionMethod get ();
	void set (ProjectionMethod value);
}
```
```fsharp
member ProjectionMethod : ProjectionMethod with get, set
```

#### Property Value

ProjectionMethod

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace